
from Robotic_Arm.rm_robot_interface import *

# 实例化RoboticArm类
arm = RoboticArm(rm_thread_mode_e.RM_TRIPLE_MODE_E)
# 创建机械臂连接，打印连接id
handle = arm.rm_create_robot_arm("169.254.128.19", 8080)
print(handle.id)

print(arm.rm_movej([-150.41700744628906, -93.30599975585938, -16.8799991607666, 69.1520004272461, 162.0850067138672, -1.152999997138977
], 20, 0, 0, 1))
# print(arm.rm_movel([0.470118, -0.134453, -0.097017, -2.316, -0.124, -1.834], 10, 0, 0, 1))
# -142.41700744628906, -93.30599975585938, -16.8799991607666, 69.1520004272461, 162.0850067138672, -1.152999997138977

# 0.190565, -0.09356, -0.423694, 2.955, -0.13, -1.636
arm.rm_delete_robot_arm()


